In [1]:
from platform import python_version
print(python_version())

3.7.6

In [1]:
import pandas as pd

In [2]:
df = {'Name': 'Rama', '1floor': 32, 'city': '32city'}

In [3]:
df

{'Name': 'Rama', '1floor': 32, 'city': '32city'}

In [8]:
orders = '/Users/ramakrishnanimmathota/Research/Bootcamp/Local_ip/orders/part-00000'

In [10]:
df = pd.read_csv(orders)
df.head()

   1  2013-07-25 00:00:00.0  11599           CLOSED
0  2  2013-07-25 00:00:00.0    256  PENDING_PAYMENT
1  3  2013-07-25 00:00:00.0  12111         COMPLETE
2  4  2013-07-25 00:00:00.0   8827           CLOSED
3  5  2013-07-25 00:00:00.0  11318         COMPLETE
4  6  2013-07-25 00:00:00.0   7130         COMPLETE

In [24]:
df = pd.read_csv(orders, header= None, names = [ '1order_id', 'order_date','product_id','order_status'])
df.head()

   1order_id             order_date  product_id     order_status
0          1  2013-07-25 00:00:00.0       11599           CLOSED
1          2  2013-07-25 00:00:00.0         256  PENDING_PAYMENT
2          3  2013-07-25 00:00:00.0       12111         COMPLETE
3          4  2013-07-25 00:00:00.0        8827           CLOSED
4          5  2013-07-25 00:00:00.0       11318         COMPLETE

In [15]:
df['order_status'].head()

0             CLOSED
1    PENDING_PAYMENT
2           COMPLETE
3             CLOSED
4           COMPLETE
Name: order_status, dtype: object

In [21]:
df['order_id']= df['1order_id']

In [22]:
df.head()

   1order_id             order_date  product_id     order_status  order_id
0          1  2013-07-25 00:00:00.0       11599           CLOSED         1
1          2  2013-07-25 00:00:00.0         256  PENDING_PAYMENT         2
2          3  2013-07-25 00:00:00.0       12111         COMPLETE         3
3          4  2013-07-25 00:00:00.0        8827           CLOSED         4
4          5  2013-07-25 00:00:00.0       11318         COMPLETE         5

In [25]:
df['order_id']= df.loc[:,'1order_id']

In [27]:
df.tail()

       1order_id             order_date  product_id     order_status  order_id
68878      68879  2014-07-09 00:00:00.0         778         COMPLETE     68879
68879      68880  2014-07-13 00:00:00.0        1117         COMPLETE     68880
68880      68881  2014-07-19 00:00:00.0        2518  PENDING_PAYMENT     68881
68881      68882  2014-07-22 00:00:00.0       10000          ON_HOLD     68882
68882      68883  2014-07-23 00:00:00.0        5533         COMPLETE     68883